tutorials/laminar/withoutHumidity/0.orig/thermo:specificHumidity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      thermo:specificHumidity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls 
    {
        type            zeroGradient;
    }

    inletTop 
    {
        type            fixedValue;
        value           uniform 0;
    }

    inletBottom 
    {
        type            fixedValue;
        value           uniform 0;
    }

    outletTop
    {
        type            zeroGradient;
    }

    outletBottom
    {
        type            zeroGradient;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
